In [1]:
import pandas as pd

df=pd.read_csv('/Users/Hoi Yee/Downloads/Datasets/employees.csv')

df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [2]:
df.Gender.value_counts()

Female    431
Male      424
Name: Gender, dtype: int64

In [3]:
df.Gender.isna().sum()

145

In [4]:
pd.Categorical(df.Gender)

[Male, Male, Female, Male, Male, ..., NaN, Male, Male, Male, Male]
Length: 1000
Categories (2, object): [Female, Male]

In [5]:
df['Gender2']= pd.Categorical(df.Gender)
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,Gender2
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing,Male
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN,Male
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance,Female
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance,Male
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services,Male

In [7]:
import random
random.choices(['very low','low','medium','high','very high'])

['very high']

In [9]:
df['Score']=pd.Series(
random.choices(['very low','low','medium','high','very high'],k=1000))
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,Gender2,Score
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing,Male,very low
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN,Male,high
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance,Female,medium
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance,Male,very low
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services,Male,very low

In [10]:
df.dtypes

First Name             object
Gender                 object
Start Date             object
Last Login Time        object
Salary                  int64
Bonus %               float64
Senior Management      object
Team                   object
Gender2              category
Score                  object
dtype: object

In [11]:
pd.Categorical(df.Score)

[very low, high, medium, very low, very low, ..., very low, high, low, very high, high]
Length: 1000
Categories (5, object): [high, low, medium, very high, very low]

In [15]:
df['Score2']=pd.Categorical(df.Score,categories=['very low','low','medium','high','very high'],ordered=True)
df['Score2']

0       very low
1           high
2         medium
3       very low
4       very low
         ...
995     very low
996         high
997          low
998    very high
999         high
Name: Score2, Length: 1000, dtype: category
Categories (5, object): [very low < low < medium < high < very high]

In [17]:
sum(df['Score2'] >'medium')

417

In [18]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,Gender2,Score,Score2
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing,Male,very low,very low
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN,Male,high,high
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance,Female,medium,medium
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance,Male,very low,very low
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services,Male,very low,very low

In [28]:
df.Salary.min(),df.Salary.max()

(35013, 149908)

In [30]:
pd.cut(df.Salary,bins = [35000,50000,75000,100000,125000,150000],labels=['very low','low','medium','high','very high'])

0         medium
1            low
2      very high
3      very high
4           high
         ...
995    very high
996     very low
997       medium
998          low
999    very high
Name: Salary, Length: 1000, dtype: category
Categories (5, object): [very low < low < medium < high < very high]